We are learning pandas

In [1]:
import pandas as pd

In [2]:
import numpy as np

In [ ]:
#Series
#They have to have an index column - unique identifiers if entrys within the eries.
s = pd.Series([0.97,12.7,24.7,26.6])
print(s)

0     0.97
1    12.70
2    24.70
3    26.60
dtype: float64

In [ ]:
m1 = pd.Series([0.97,12.7,24.7,26.6], name="height")
print(m)

0     0.97
1    12.70
2    24.70
3    26.60
Name: height, dtype: float64

In [ ]:
#Creating an index column:
# - be careful not to have duplicate indices 
# - the indices should match the data entries
m2 = pd.Series([0.97,12.7,24.7,26.6], name="height", index=["a","b","c","d"])
print(m2)

a     0.97
b    12.70
c    24.70
d    26.60
Name: height, dtype: float64

In [ ]:
#Extract the indices
m2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

From dictionaries

In [9]:
population = {"Nairobi":350000, "Mombasa":250000,"Kitale":150000}
type(population)

dict

In [12]:
pop = pd.Series(population)
pop

Nairobi    350000
Mombasa    250000
Kitale     150000
dtype: int64

In [13]:
#to see the values only
pop.values

array([350000, 250000, 150000])

DataFrame
- Using dictionaries
- Using lists

In [14]:
population

{'Nairobi': 350000, 'Mombasa': 250000, 'Kitale': 150000}

In [15]:
area ={"Nairobi":2400,"Mombasa":3500,"Kitale":5500}

In [17]:
regions = pd.DataFrame({"pop":population,"cubic_meters":area})
print(regions)
regions.index

            pop  cubic_meters
Nairobi  350000          2400
Mombasa  250000          3500
Kitale   150000          5500

Index(['Nairobi', 'Mombasa', 'Kitale'], dtype='object')

In [43]:
data = {"Name":["Atieno","Awendy","Annex"],
"Module":["Python","Machine learning","Data Science"], "Score":[95,97,94]}

In [44]:
df = pd.DataFrame(data)
print(df)

     Name            Module  Score
0  Atieno            Python     95
1  Awendy  Machine learning     97
2   Annex      Data Science     94

In [27]:
df

     Name            Module Score
0  Atieno            Python    95
1  Awendy  Machine learning    97
2   Annex      Data Science    94

Commands within pandas

In [28]:
#prints the first 5 rows within a data set
df.head(2)

     Name            Module Score
0  Atieno            Python    95
1  Awendy  Machine learning    97

In [29]:
#prints the last 5  rows of a data set
df.tail(2)

     Name            Module Score
1  Awendy  Machine learning    97
2   Annex      Data Science    94

In [45]:
#get more info about the data frame
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Module  3 non-null      object
 2   Score   3 non-null      int64
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

In [57]:
#a numerical summary of all the integer and float columns within the data frame
df.describe()

           Score
count   3.000000
mean   95.333333
std     1.527525
min    94.000000
25%    94.500000
50%    95.000000
75%    96.000000
max    97.000000

In [47]:
#verson of pandas
pd.__version__

'2.3.2'

In [52]:
#get shape of the dataframe
df.shape

(3, 3)

In [ ]:
df.columns #columns in the dataframe

Index(['Name', 'Module', 'Score'], dtype='object')

In [ ]:
df.dtypes #datatpes in the DF

Name      object
Module    object
Score      int64
dtype: object

In [55]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [58]:
#extract one name series-object
df["Name"]

0    Atieno
1    Awendy
2     Annex
Name: Name, dtype: object

In [59]:
#extract multiple series-objects
df[["Name","Score"]]

     Name  Score
0  Atieno     95
1  Awendy     97
2   Annex     94

In [60]:
df[["Name"]]

     Name
0  Atieno
1  Awendy
2   Annex

In [65]:
#index locator
df.iloc[0] #has extracted the first row

Name      Atieno
Module    Python
Score         95
Name: 0, dtype: object

In [64]:
df.iloc[0:2,0:2]

     Name            Module
0  Atieno            Python
1  Awendy  Machine learning